{"logs":[{"timestamp":"26/4/2023 22:58","text":"Initial Log:\r\n<hr>\r\n<blockquote> Removing unecessary Logs. Note that it is not a diary entry. It's an Official Logging Platform for logging progress. It will contain important updates, observations and strategies. </blockquote>\r\n\r\nGoal is to increase marks to 100%."},{"timestamp":"26/4/2023 23:15","text":"Current Strategy:<hr>\r\nOrder: M -> P -> C\r\n\r\nTry to complete each subject in 1 hour or before (No exception for maths)\r\n\r\nDelocalised Strict Time Management: min. 3 questions every 10 minutes"},{"timestamp":"28/4/2023 17:22","text":"DQ strategy\r\n<hr>\r\n\r\nMaximum Allowed Time For DQ of 1 paper: 2 Hr\r\n\r\n=> Maximum for 1 subject of 1 paper: 40min"},{"timestamp":"29/4/2023 17:58","text":"Strategy Update\r\n<hr>\r\n\r\nIn match the following questions with 2 questions linked, Always before solving anything look at options of both the questions.\r\n\r\n<b> If They Have a Common Option, then you need to only solve that (or sometimes even not solve anything)</b>\r\n"},{"timestamp":"30/4/2023 22:35","text":"Last Month Preparation Strategy\r\n<hr>\r\n<ul>\r\n<li>Complete GRPs for Revision</li>\r\n<li>Complete Allen and Fiitjee Test Questions, which give all star batch materials</li>\r\n</ul>"},{"timestamp":"1/5/2023 17:12","text":"List of All Deceptive Tricks in Questions\r\n<hr>\r\nA list of deceptive questions are maintained at <a href='//keep.google.com'>Google Keep</a> under email <kbd>hemantkumartwo@gmail.com</kbd>"},{"timestamp":"2/5/2023 18:45","text":"Strategy Update\r\n<hr>\r\nIn match the following questions (not paragraph based), solve that option first which has least number of words."},{"timestamp":"2/5/2023 18:45","text":"Strategy Update\r\n<hr>\r\nDon't Forget Dimensional analysis\r\n"},{"timestamp":"4/5/2023 18:27","text":"Urgent Update\r\n<hr>\r\nbased on previous years highest marks, it can be concluded that, to get good marks, you have to attempt the paper completely. \r\n<b>DO MORE, GET MORE</b>\r\n It means you must not have any question that you did not tried atleast once during the paper. (Still can leave if you are unable to do)\r\n<blockquote>Within one Week, by any means increase your speed so that you leave no question skipped without reading it.\r\n</blockquote>\r\n"},{"timestamp":"6/5/2023 17:57","text":"Suggestion\r\n<hr>\r\n\r\nalways have a thought of putting π = 22/7 before 3.14 <small>(except when calculation is very simple)</small>"},{"timestamp":"6/5/2023 23:24","text":"At this Time I am lacking a lot in Physics"},{"timestamp":"7/5/2023 18:41","text":"I have got a habit of spending 1.5 hours in Maths. Aiming to take that down to 1hr. (doing rest at end of paper)"},{"timestamp":"8/5/2023 11:28","text":"NEXT Allen Test Target\r\nMarks > 210\r\nRank  < 80"},{"timestamp":"13/5/2023 22:3","text":"The target failed largely. instead i got the worst rank and marks until now. 289 rank (from 99) and 96 marks out of 360.\r\n\r\nThe culprit seems to be the FIITJEE paper i gave yesterday for practice\r\n<blockquote>Never give a full paper in the evening before exam. Instead select some super hard questions, solve them and look their solutions.</blockquote>"},{"timestamp":"13/5/2023 22:5","text":"Also failed in improving time. Now From 15 may i will be doing 2 GRPs (30 questions) in 1 hr.\r\n// 4 GRPs of chemistry in 1 hr. \r\n\r\n// Keep in mind while solving the speed. Don't focus on accuracy. Instead constantly improve accuracy while DQing (upsolving)"},{"timestamp":"15/5/2023 15:2","text":"STRICT: DO NOT CHANGE PAPER ATTEMPTING PATTERN. FOLLOW MPC. as jee advanced maths is hardest in recent years."},{"timestamp":"15/5/2023 17:9","text":"If i do not waste time today, then i can RewardM me after completing that day's study."},{"timestamp":"16/5/2023 15:28","text":"Useful math aware search engine. However can only accept atmost 3 tags\r\n\r\n<a href=\"https://approach0.xyz/\">https://approach0.xyz/</a>"},{"timestamp":"20/5/2023 21:46","text":"Today's paper 2 went really well. \r\nSo, Changing The Paper Strategy to\r\n<b>Maths -> Chemistry -> Physics</b>\r\n\r\nAlso i solved maths in 1hr 5mins. So that was a success. \r\n2 weaks, do the Maximum Development"},{"timestamp":"20/5/2023 22:58","text":"Before Exam remember how you failed hardly in last exams"},{"timestamp":"29/5/2023 18:12","text":"Last week is really anxious one. Most uncertain. Hard to Focus"}]}